Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СервисПрогнозированияПереопределяемыйКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Реквизиты справочника Виды планов, необходимые для сервиса прогнозирования.
// 
// Возвращаемое значение:
//  Строка - список реквизитов.
Функция РеквизитыВидаПланаДляСервисаПрогнозирования() Экспорт
	
	Возврат "Периодичность, КоличествоПериодов,
		|АвтоматическиОбновлятьПрогноз, ПериодичностьОбновленияПрогноза, КоличествоОбновленийЗаПериод,
		|МетрикаОценкиКачестваПрогноза, ВзвешиваниеОбъектовПриПодсчетеМетрики, УчетПотерянныхПродаж,
		|КоэффициентВосстановленияУчетаПотерянныхПродаж, СглаживаниеВыбросовИсторическихДанных,
		|НижняяГраницаВыброса, ВерхняяГраницаВыброса, РассчитыватьОтклонениеПоСезоннымЗначениям,
		|НачалоПрогнозирования, ДополнительноеСвойствоВзвешивания, ЗаполнятьПоДаннымСервиса,
		|УскоритьОбучениеСПотерейКачества, КоличествоПериодовДляОценкиТочности, ИсключатьСезонность,
		|РеквизитыРасчетаСезонности, ДеньНеделиНачалаПрогноза, ИдентификаторМоделиПрогнозирования,
		|ВариантПрогнозированияПоКатегориям";
	
КонецФункции

// Значения по умолчанию реквизитов справочника Виды планов, необходимые для сервиса прогнозирования.
// 
// Возвращаемое значение:
//  Структура:
//  * Периодичность - ПеречислениеСсылка.Периодичность -
//  * ДеньНеделиНачалаПрогноза - ПеречислениеСсылка.ДниНедели - 
//  * КоличествоПериодов - Число - 
//  * АвтоматическиОбновлятьПрогноз - Булево - 
//  * ПериодичностьОбновленияПрогноза - Число - 
//  * КоличествоОбновленийЗаПериод - Число - 
//  * МетрикаОценкиКачестваПрогноза - Строка - 
//  * ВзвешиваниеОбъектовПриПодсчетеМетрики - Число - 
//  * УчетПотерянныхПродаж - Число - 
//  * КоэффициентВосстановленияУчетаПотерянныхПродаж - Число - 
//  * СглаживаниеВыбросовИсторическихДанных - Число - 
//  * НижняяГраницаВыброса - Число -
//  * ВерхняяГраницаВыброса - Число - 
//  * РассчитыватьОтклонениеПоСезоннымЗначениям - Число - 
//  * НачалоПрогнозирования - Дата - 
//  * ДополнительноеСвойствоВзвешивания - Строка - 
//  * ЗаполнятьПоДаннымСервиса - Булево - 
//  * УскоритьОбучениеСПотерейКачества - Булево - 
//  * КоличествоПериодовДляОценкиТочности - Число - 
//  * ВариантПрогнозированияПоКатегориям - Число - 
Функция ЗначенияВидаПлановПоУмолчанию() Экспорт
	
	Структура = Новый Структура(РеквизитыВидаПланаДляСервисаПрогнозирования());
	
	Структура.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя");
	Структура.ДеньНеделиНачалаПрогноза = ПредопределенноеЗначение("Перечисление.ДниНедели.Понедельник");
	Структура.КоличествоПериодов = 5;
	Структура.АвтоматическиОбновлятьПрогноз = Ложь;
	Структура.ПериодичностьОбновленияПрогноза = 0;
	Структура.КоличествоОбновленийЗаПериод = 0;
	Структура.МетрикаОценкиКачестваПрогноза = "MAE";
	Структура.ВзвешиваниеОбъектовПриПодсчетеМетрики = 0;
	Структура.УчетПотерянныхПродаж = 0;
	Структура.КоэффициентВосстановленияУчетаПотерянныхПродаж = 0.5;
	Структура.СглаживаниеВыбросовИсторическихДанных = 0;

	Структура.НижняяГраницаВыброса = 2;
	Структура.ВерхняяГраницаВыброса = 2;
	Структура.РассчитыватьОтклонениеПоСезоннымЗначениям = 0;
	Структура.НачалоПрогнозирования = Неопределено;
	Структура.ДополнительноеСвойствоВзвешивания = "";
	Структура.ЗаполнятьПоДаннымСервиса = Истина;
	Структура.УскоритьОбучениеСПотерейКачества = Ложь;
	Структура.КоличествоПериодовДляОценкиТочности = 4;
	
	Структура.ИдентификаторМоделиПрогнозирования = -1;
	Структура.ВариантПрогнозированияПоКатегориям = 0;
	
	Возврат Структура;
	
КонецФункции

// Описание выгружаемого элемента данных.
// 
// Параметры:
//  ОсновноеОписание - Структура - см. ОсновноеОписаниеВыгружаемогоЭлементаДанных:
//  * ИмяВСервисе - Строка - 
//  * Обязательный - Булево -
//  * Выгружать - Булево -  
//  * ИмяВИсточнике - ПеречислениеСсылка.КоллекцииСервисаПрогнозированияПродаж, Строка - 
//  * ТипДанных - Строка - 
//  Представление - Строка -
//  Категориальный - Булево - 
//  ВложенноеОписание - см. ОписаниеВыгружаемогоЭлементаДанных.
// Возвращаемое значение:
//  Структура:
//  * ИмяВСервисе - Строка - 
//  * Обязательный - Булево -
//  * Выгружать - Булево -  
//  * ИмяВИсточнике - ПеречислениеСсылка.КоллекцииСервисаПрогнозированияПродаж, Строка - 
//  * ТипДанных - Строка - 
//  * Представление - Строка -
//  * Категориальный - Булево - 
//  * ВложенноеОписание - см. ОписаниеВыгружаемогоЭлементаДанных.
Функция ОписаниеВыгружаемогоЭлементаДанных(ОсновноеОписание,
	Представление = "",
	Категориальный = Истина,
	ВложенноеОписание = Неопределено) Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("ИмяВСервисе",       ОсновноеОписание.ИмяВСервисе);
	Структура.Вставить("Обязательный",      ОсновноеОписание.Обязательный);
	Структура.Вставить("Выгружать",         ОсновноеОписание.Выгружать);
	Структура.Вставить("ИмяВИсточнике",     ОсновноеОписание.ИмяВИсточнике); // Источником является запрос выборки данных.
	Структура.Вставить("ТипДанных",         ОсновноеОписание.ТипДанных); // Тип коллекции или данных реквизита.
	Структура.Вставить("Представление",     Представление);
	Структура.Вставить("Категориальный",    Категориальный);
	Структура.Вставить("ВложенноеОписание", ВложенноеОписание); // Описание предопределенных реквизитов сервиса.
	
	Структура.Вставить("ЭтоПользовательскоеПоле", Ложь);
	Структура.Вставить("ДополнительноеСвойство", Неопределено); // Дополнительный реквизит (сведение).
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти
